Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.0.31/edc/ATSAML10E16A.PIC
      <edc:SFRDef edc:_addr="0x42001C2C" edc:access="-----nnn-----nnn" edc:cname="CALIB" edc:impl="0x707" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="BIASCOMP" edc:desc="Bias Comparator Scaling" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BIASREFBUF" edc:desc="Bias  Reference Buffer Scaling" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42001C2E" edc:offset="0x3D2"/>
      <edc:SFRDef edc:_addr="0x42002000" edc:access="-n----nn" edc:cname="CTRLA" edc:impl="0x43" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002001" edc:access="nnn-nnnn" edc:cname="CTRLB" edc:impl="0xEF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="EOEN" edc:desc="External Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IOEN" edc:desc="Internal Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:desc="Left Adjusted Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VPD" edc:desc="Voltage Pump Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:desc="Dither Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFSEL" edc:desc="Reference Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="INTREF" edc:desc="Internal Voltage reference" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VDDANA" edc:desc="Analog Voltage Supply" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="VREFA" edc:desc="External reference" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002002" edc:access="-----nnn" edc:cname="EVCTRL" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="STARTEI" edc:desc="Start Conversion Event Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTYEO" edc:desc="Data Buffer Empty Event Output" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEI" edc:desc="Invert Event Input" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42002003" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x42002004" edc:access="------nn" edc:cname="INTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:desc="Underrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY" edc:desc="Data Buffer Empty Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002005" edc:access="------nn" edc:cname="INTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:desc="Underrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY" edc:desc="Data Buffer Empty Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002006" edc:access="------nn" edc:cname="INTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:desc="Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY" edc:desc="Data Buffer Empty" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002007" edc:access="-------r" edc:cname="STATUS" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="READY" edc:desc="Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002008" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATA" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data value to be converted" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200200A" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4200200C" edc:access="wwwwwwwwwwwwwwww" edc:cname="DATABUF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATABUF" edc:desc="Data Buffer" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200200E" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42002010" edc:access="----------------------------rrrr" edc:cname="SYNCBUSY" edc:impl="0xF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATABUF" edc:desc="Data Buffer" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002014" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42002015" edc:offset="0x7EB"/>
      <edc:SFRDef edc:_addr="0x42002800" edc:access="-n----n-" edc:cname="CTRLA" edc:impl="0x42" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TRNG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
